Add docs about new openbao config (#562)
* docs: add docs about new openbao config

* docs: refactor secret management docs

* docs: refactor secret management docs
